[
  {
    "id": "overview-reading-strategy",
    "section": "ภาพรวม",
    "sectionLabel": "ภาพรวมการอ่าน",
    "code": "OV1",
    "title": "กลยุทธ์อ่าน + ทำข้อสอบ",
    "badge": "แผนอ่าน 3 ขั้น",
    "summary": "ใช้ลูป อ่าน → ทำข้อสอบ → ทบทวนจุดอ่อน เพื่อเก็บเนื้อหาให้ครบทุกภาค.",
    "focus": [
      "ภาค ก เน้นกฎหมายพื้นฐาน / ท้องถิ่น / การคลัง / จัดซื้อจัดจ้าง",
      "ภาค ข เน้นวิชาชีพพยาบาล / กฎหมายสุขภาพ / EMS / Triage",
      "ภาค ค เน้นทัศนคติ / การทำงานเป็นทีม / ความเป็นคนท้องถิ่น"
    ],
    "groups": [
      {
        "title": "แผนอ่านแนะนำ",
        "bullets": [
          "อ่านเนื้อหาทุกหัวข้อแบบไล่ไปทีละส่วน (GA → GB → GC)",
          "จดประเด็นสำคัญและตัวเลขที่ชอบออกสอบบ่อย",
          "ทำข้อสอบ 100 ข้อ จาก exam-100.html เพื่อเช็กว่าเข้าใจจริง",
          "กลับมาดูหัวข้อที่ผิดบ่อย แล้วอ่านทวนเฉพาะจุดนั้นซ้ำ"
        ]
      }
    ],
    "quizTitle": "Mini-quiz ภาพรวม",
    "quiz": [
      "ถ้าเวลาจำกัด ควรโฟกัสหัวข้อใดก่อนในภาค ก / ภาค ข / ภาค ค?",
      "คุณวางแผนจะวนลูป อ่าน → ทำข้อสอบ → ทบทวน บ่อยแค่ไหนต่อสัปดาห์?"
    ],
    "quizHint": "พยายามจัดตารางอ่านที่ทำได้จริง เช่น วันละ 1–2 หัวข้อ พร้อมทำข้อสอบตามหลัง."
  },
  {
    "id": "ga-constitution",
    "section": "ภาค ก",
    "sectionLabel": "ภาค ก — หัวข้อ 1",
    "code": "GA1",
    "title": "รัฐธรรมนูญ 2560, รูปแบบการปกครอง และโครงสร้างรัฐ",
    "badge": "จำให้ได้ ตัวเลขสำคัญ / อำนาจ 3 ฝ่าย",
    "summary": "โครงสร้างรัฐไทยอยู่ภายใต้รัฐธรรมนูญ 2560 ซึ่งกำหนดรูปแบบการปกครองและอำนาจอธิปไตยชัดเจน.",
    "focus": [
      "วันประกาศใช้รัฐธรรมนูญ 2560",
      "ความหมายของอำนาจอธิปไตยเป็นของปวงชนชาวไทย",
      "จำนวน ส.ส. / ส.ว. และวาระการดำรงตำแหน่ง"
    ],
    "groups": [
      {
        "title": "1. ภาพรวมรัฐธรรมนูญ 2560",
        "bullets": [
          "เป็นกฎหมายสูงสุดของประเทศ หากกฎหมายอื่นขัดหรือแย้งกับรัฐธรรมนูญ ให้ใช้รัฐธรรมนูญเป็นหลัก.",
          "ประกาศใช้เมื่อวันที่ 6 เมษายน 2560.",
          "กำหนดให้มียุทธศาสตร์ชาติระยะยาวประมาณ 20 ปี เพื่อใช้เป็นกรอบการบริหารราชการแผ่นดิน."
        ]
      },
      {
        "title": "2. รูปแบบการปกครอง",
        "bullets": [
          "ประเทศไทยปกครองในระบอบประชาธิปไตยอันมีพระมหากษัตริย์ทรงเป็นประมุข.",
          "อำนาจอธิปไตยเป็นของปวงชนชาวไทย ใช้ผ่านองค์กรตามรัฐธรรมนูญ เช่น รัฐสภา คณะรัฐมนตรี ศาล.",
          "แยกอำนาจออกเป็น นิติบัญญัติ บริหาร และตุลาการ เพื่อลดการรวบอำนาจอยู่ที่องค์กรเดียว."
        ]
      },
      {
        "title": "3. ตัวเลขสำคัญที่ออกสอบบ่อย",
        "bullets": [
          "สมาชิกสภาผู้แทนราษฎร (ส.ส.) 500 คน วาระ 4 ปี (แบบแบ่งเขต 400 คน + บัญชีรายชื่อ 100 คน).",
          "สมาชิกวุฒิสภา (ส.ว.) 200 คน วาระ 5 ปี.",
          "องค์กรอิสระสำคัญ เช่น กกต., ป.ป.ช., ผู้ตรวจการแผ่นดิน, กสม., ศาลรัฐธรรมนูญ เป็นต้น."
        ]
      }
    ],
    "quizTitle": "Mini-quiz GA1",
    "quiz": [
      "รัฐธรรมนูญ 2560 ประกาศใช้เมื่อวันที่เท่าใด และมียุทธศาสตร์ชาติระยะเวลากี่ปี?",
      "อธิบายความหมายของคำว่า “อำนาจอธิปไตยเป็นของปวงชนชาวไทย” ในมุมมองของคุณเอง.",
      "จำนวน ส.ส. และ ส.ว. ตามรัฐธรรมนูญ 2560 เป็นเท่าใด และวาระการดำรงตำแหน่งกี่ปี?"
    ],
    "quizHint": "โฟกัสตัวเลข 500 ส.ส., 200 ส.ว., วาระ 4 ปี / 5 ปี และวันที่ 6 เมษายน 2560."
  }
]
