[
  {
    "id": "overview-strategy",
    "section": "ภาพรวม",
    "sectionLabel": "ภาพรวมการอ่าน",
    "code": "OV1",
    "title": "กลยุทธ์การอ่าน & การใช้ข้อสอบ 100 ข้อ",
    "badge": "แผนอ่าน",
    "summary": "จัดลำดับการอ่านให้เป็นรอบ ๆ: 1) อ่านเนื้อหา 2) ทำ mini-quiz หัวข้อนั้น 3) ไปลองทำข้อสอบ 100 ข้อ แล้วกลับมาดูเฉลยและจุดที่พลาด",
    "focus": [
      "รู้ภาพรวมว่าอะไรอยู่ภาค ก / ภาค ข / ภาค ค",
      "อ่านเนื้อหาแบบเข้าใจภาพใหญ่ ไม่ใช่ท่องมาตราอย่างเดียว",
      "ใช้ mini-quiz และ exam-100.html เป็นตัวเช็กช่องโหว่",
      "วนรอบสั้น ๆ หลายรอบ ดีกว่าอ่านยาวรอบเดียว"
    ],
    "groups": [
      {
        "title": "แนวทางใช้ชุดสรุป + ข้อสอบ",
        "bullets": [
          "รอบที่ 1: อ่านหัวข้อทุกอันแบบเร็ว ๆ ให้รู้ว่ามีเรื่องอะไรบ้าง",
          "รอบที่ 2: อ่านละเอียดขึ้น พร้อมจด keyword ของแต่ละหัวข้อ",
          "รอบที่ 3: ทำ mini-quiz ในแต่ละหัวข้อจาก exam-notes.html",
          "รอบที่ 4: ทำข้อสอบใน exam-100.html แบบจับเวลาเหมือนสอบจริง",
          "หลังทำข้อสอบ: ดูเฉลย เปรียบเทียบกับโน้ต วงจุดที่ยังไม่แม่น"
        ]
      },
      {
        "title": "การแบ่งเวลาอ่าน (ตัวอย่างสำหรับคนทำงาน)",
        "bullets": [
          "วันธรรมดา: อย่างน้อยวันละ 1–2 หัวข้อ (สั้นแต่สม่ำเสมอ)",
          "เสาร์–อาทิตย์: ทำข้อสอบ 1 ชุดเต็ม ๆ แล้วทบทวนเฉลย",
          "ก่อนสอบ 7 วัน: เน้นทวนโน้ตและ keyword แต่ละหัวข้อ",
          "ก่อนสอบ 1 วัน: อ่าน overview / keyword / นิยามสำคัญ ไม่อัดข้อสอบเพิ่ม"
        ]
      }
    ],
    "quizTitle": "Mini-quiz ภาพรวม",
    "quiz": [
      "ถ้ามีเวลาอ่านวันละไม่เกิน 2 ชั่วโมง จะจัดลำดับอ่าน ภาค ก / ข / ค อย่างไร?",
      "นิสัยอ่านหนังสือแบบไหนของตัวเองที่ต้องระวัง (เช่น อ่านเพลินแต่ไม่ทำข้อสอบ)?"
    ],
    "quizHint": "ลองเขียนแผนอ่านจริงบนกระดาษ หรือใน note แล้วเอามาเช็กกับจำนวนหัวข้อใน exam-notes.json"
  },
  {
    "id": "ga-constitution",
    "section": "ภาค ก",
    "sectionLabel": "ภาค ก — กฎหมายพื้นฐาน",
    "code": "GA1",
    "title": "รัฐธรรมนูญ 2560, รูปแบบการปกครอง และโครงสร้างรัฐ",
    "badge": "จำตัวเลข / โครงสร้างรัฐ",
    "summary": "โฟกัส 3 เรื่องหลัก: (1) รัฐธรรมนูญ 2560 เป็นกฎหมายสูงสุด (2) ระบอบประชาธิปไตยอันมีพระมหากษัตริย์ทรงเป็นประมุข (3) โครงสร้างรัฐและอำนาจ 3 ฝ่าย + ตัวเลข ส.ส. / ส.ว.",
    "focus": [
      "วันที่ประกาศใช้รัฐธรรมนูญ 2560",
      "ความหมายของอำนาจอธิปไตยเป็นของปวงชนชาวไทย",
      "อำนาจนิติบัญญัติ / บริหาร / ตุลาการ คือใคร ทำอะไร",
      "โครงสร้างส่วนราชการ: ส่วนกลาง / ภูมิภาค / ท้องถิ่น",
      "จำนวน ส.ส. / ส.ว. และวาระ"
    ],
    "groups": [
      {
        "title": "ภาพรวมรัฐธรรมนูญ 2560",
        "bullets": [
          "เป็นกฎหมายสูงสุดของประเทศ ประกาศใช้ 6 เมษายน 2560",
          "กำหนดหลักสิทธิ–เสรีภาพของประชาชน โครงสร้างรัฐ ยุทธศาสตร์ชาติ และการปฏิรูปประเทศ",
          "ยุทธศาสตร์ชาติเป็นกรอบระยะยาว ~20 ปี ใช้กำหนดทิศทางการพัฒนาประเทศ"
        ]
      },
      {
        "title": "รูปแบบการปกครองของไทย",
        "bullets": [
          "ระบอบประชาธิปไตยอันมีพระมหากษัตริย์ทรงเป็นประมุข",
          "อำนาจอธิปไตยเป็นของปวงชนชาวไทย ใช้ผ่านองค์กรตามรัฐธรรมนูญ",
          "พระมหากษัตริย์ทรงใช้อำนาจผ่านฝ่ายนิติบัญญัติ บริหาร และตุลาการ"
        ]
      },
      {
        "title": "อำนาจ 3 ฝ่าย",
        "bullets": [
          "นิติบัญญัติ — รัฐสภา (ส.ส. + ส.ว.) มีหน้าที่ออกกฎหมาย",
          "บริหาร — คณะรัฐมนตรีภายใต้นายกรัฐมนตรี บริหารราชการแผ่นดิน",
          "ตุลาการ — ศาลต่าง ๆ มีหน้าที่วินิจฉัยคดีและตีความกฎหมาย"
        ]
      },
      {
        "title": "การแบ่งส่วนราชการ",
        "bullets": [
          "ส่วนกลาง: สำนักนายกฯ กระทรวง กรม ฯลฯ",
          "ส่วนภูมิภาค: จังหวัด (ผู้ว่าราชการจังหวัด) และอำเภอ (นายอำเภอ)",
          "ส่วนท้องถิ่น: อบจ., เทศบาล, อบต., กทม., เมืองพัทยา ฯลฯ"
        ]
      },
      {
        "title": "ตัวเลขที่ออกสอบบ่อย",
        "bullets": [
          "สภาผู้แทนราษฎร: ส.ส. 500 คน (เขต 400 + บัญชีรายชื่อ 100) วาระ 4 ปี",
          "วุฒิสภา: ส.ว. 200 คน วาระ 5 ปี",
          "องค์กรอิสระสำคัญ: กกต., ป.ป.ช., ผู้ตรวจการแผ่นดิน, คตง., กสม., ศาลรัฐธรรมนูญ"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GA1",
    "quiz": [
      "ระบุจำนวน ส.ส. เขต / บัญชีรายชื่อ / รวมทั้งหมด และจำนวน ส.ว. พร้อมวาระดำรงตำแหน่ง",
      "ยกตัวอย่างองค์กรอิสระ 3 แห่ง พร้อมหน้าที่หลักแบบสั้น ๆ"
    ],
    "quizHint": "โฟกัสตัวเลข 500 / 200 / 4 ปี / 5 ปี และจำโครงสร้างส่วนราชการ 3 ระดับให้ขึ้นใจ"
  },
  {
    "id": "ga-provincial-admin",
    "section": "ภาค ก",
    "sectionLabel": "ภาค ก — ท้องถิ่น",
    "code": "GA2",
    "title": "องค์การบริหารส่วนจังหวัด (อบจ.) — โครงสร้าง อำนาจหน้าที่ และรายได้",
    "badge": "อบจ. ออกสอบแน่นอน",
    "summary": "เข้าใจว่า อบจ. เป็น อปท. ระดับจังหวัด มีสภา อบจ. และนายก อบจ. ที่มาจากการเลือกตั้งโดยตรง ดูภาพรวมรายได้และบทบาทด้านสาธารณสุข/ชุมชน",
    "focus": [
      "อบจ. เป็นนิติบุคคลและเป็นองค์กรปกครองส่วนท้องถิ่น",
      "สภา อบจ. = ฝ่ายนิติบัญญัติท้องถิ่น / นายก อบจ. = ฝ่ายบริหาร",
      "ทั้งสภาและนายกมาจากการเลือกตั้ง วาระ 4 ปี",
      "ผู้ว่าราชการจังหวัดเป็นผู้กำกับดูแล",
      "ประเภทของรายได้ อบจ."
    ],
    "groups": [
      {
        "title": "สถานะและโครงสร้าง อบจ.",
        "bullets": [
          "อบจ. เป็นนิติบุคคลตาม พ.ร.บ.องค์การบริหารส่วนจังหวัด",
          "รับผิดชอบภาพรวมการพัฒนาท้องถิ่นในระดับจังหวัด",
          "มี 2 ฝ่ายหลัก: สภา อบจ. และนายก อบจ."
        ]
      },
      {
        "title": "บทบาทของสภา อบจ.",
        "bullets": [
          "เป็นฝ่ายนิติบัญญัติท้องถิ่น ออกข้อบัญญัติ อบจ.",
          "อนุมัติงบประมาณ ตรวจสอบการทำงานของฝ่ายบริหาร",
          "สมาชิกมาจากการเลือกตั้ง วาระ 4 ปี"
        ]
      },
      {
        "title": "บทบาทของนายก อบจ.",
        "bullets": [
          "เป็นหัวหน้าฝ่ายบริหารท้องถิ่นของ อบจ.",
          "บริหารงาน โครงการ บุคลากร และงบประมาณให้สอดคล้องนโยบาย",
          "มาจากการเลือกตั้งโดยตรงของประชาชน วาระ 4 ปี"
        ]
      },
      {
        "title": "การกำกับดูแลและรายได้",
        "bullets": [
          "ผู้ว่าราชการจังหวัดเป็นผู้กำกับดูแลให้การดำเนินการของ อบจ. เป็นไปตามกฎหมาย",
          "รายได้ของ อบจ. มาจากภาษี/ค่าธรรมเนียมท้องถิ่น เงินอุดหนุน และรายได้อื่น ๆ",
          "อบจ. สามารถสนับสนุนด้านสาธารณสุข เช่น รถ EMS, โครงการสุขภาพชุมชน, สนับสนุน รพ.สต."
        ]
      }
    ],
    "quizTitle": "Mini-quiz GA2",
    "quiz": [
      "สภา อบจ. และนายก อบจ. มีความแตกต่างกันอย่างไรในแง่หน้าที่?",
      "ใครเป็นผู้กำกับดูแล อบจ. และมีอำนาจทำอะไรได้บ้างเมื่อพบว่า อบจ. ทำผิดกฎหมาย?"
    ],
    "quizHint": "จำให้ชัดว่า สภา = ออกข้อบัญญัติ/งบประมาณ, นายก = บริหาร, ผู้ว่าฯ = กำกับดูแลไม่ใช่ผู้บังคับบัญชาโดยตรง"
  },
  {
    "id": "ga-foi-good-governance",
    "section": "ภาค ก",
    "sectionLabel": "ภาค ก — กฎหมายทั่วไป",
    "code": "GA3",
    "title": "พ.ร.บ.ข้อมูลข่าวสารของราชการ และบ้านเมืองที่ดี",
    "badge": "เปิดเผยเป็นหลัก",
    "summary": "โฟกัส keyword “เปิดเผยเป็นหลัก ปกปิดเป็นข้อยกเว้น” และ 7 เป้าหมายการบริหารกิจการบ้านเมืองที่ดี ออกสอบเป็นตัวเลือกบ่อยมาก",
    "focus": [
      "หลักเปิดเผยเป็นหลัก ปกปิดเป็นข้อยกเว้น",
      "ประเภทของข้อมูลข่าวสารราชการ",
      "บทบาทคณะกรรมการข้อมูลข่าวสาร",
      "เป้าหมาย 7 ข้อของบ้านเมืองที่ดี",
      "แนวคิดให้บริการประชาชนแบบโปร่งใสและลดขั้นตอน"
    ],
    "groups": [
      {
        "title": "พ.ร.บ.ข้อมูลข่าวสารของราชการ 2540",
        "bullets": [
          "หลักสำคัญ: เปิดเผยเป็นหลัก ปกปิดเป็นข้อยกเว้น",
          "ข้อมูลที่ต้องเปิดเผย: โครงสร้าง อำนาจหน้าที่ กฎ ระเบียบ สัญญาสัมปทาน แผนงาน/โครงการที่มีผลต่อประชาชน",
          "ข้อมูลที่อาจเปิดเผยได้: ข้อมูลส่วนบุคคล ต้องมีการคุ้มครองความเป็นส่วนตัว",
          "ข้อมูลที่ไม่ต้องเปิดเผย: เรื่องความมั่นคง ความปลอดภัย หรือที่กฎหมายกำหนด",
          "มีคณะกรรมการข้อมูลข่าวสารทำหน้าที่วินิจฉัยกรณีพิพาท"
        ]
      },
      {
        "title": "พระราชกฤษฎีกาบริหารกิจการบ้านเมืองที่ดี 2546",
        "bullets": [
          "มีเป้าหมาย 7 ข้อ เช่น เกิดประโยชน์สุขของประชาชน, เกิดผลสัมฤทธิ์ต่อภารกิจของรัฐ, มีประสิทธิภาพและความคุ้มค่า",
          "ลดขั้นตอนการปฏิบัติงานที่เกินจำเป็น ปรับปรุงภารกิจให้ทันสถานการณ์",
          "อำนวยความสะดวกและตอบสนองประชาชน + มีการประเมินผลการปฏิบัติงานอย่างสม่ำเสมอ"
        ]
      },
      {
        "title": "การบริการประชาชนตามหลักบ้านเมืองที่ดี",
        "bullets": [
          "กำหนดระยะเวลาแล้วเสร็จของงานแต่ละประเภทให้ชัดเจน",
          "ใช้แนวทาง One Stop Service เมื่อเหมาะสม",
          "เปิดช่องทางรับฟังความคิดเห็นและข้อร้องเรียนของประชาชน"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GA3",
    "quiz": [
      "ยกตัวอย่างงานของ อบจ. ที่สะท้อนหลักเปิดเผยเป็นหลัก และลดขั้นตอนพร้อมกันได้ 1 ตัวอย่าง",
      "ใน 7 เป้าหมายของบ้านเมืองที่ดี ข้อใดเน้นประชาชน ข้อใดเน้นระบบภายใน?"
    ],
    "quizHint": "ข้อสอบชอบถามว่า ข้อใด ‘ไม่ใช่’ เป้าหมายของบ้านเมืองที่ดี หรือถามเรียงลำดับข้อ 1–7"
  },
  {
    "id": "ga-fiscal-procurement",
    "section": "ภาค ก",
    "sectionLabel": "ภาค ก — การคลังและจัดซื้อจัดจ้าง",
    "code": "GA4",
    "title": "วินัยการเงินการคลัง / เศรษฐกิจพอเพียง / การจัดซื้อจัดจ้างภาครัฐ",
    "badge": "จับผิดตัวอย่างที่ผิด",
    "summary": "ต้องแยกให้ออกว่าอะไร “คุ้มค่า โปร่งใส ตรวจสอบได้” และอะไรเสี่ยงผิดวินัยการคลังหรือผิด พ.ร.บ.จัดซื้อจัดจ้างฯ",
    "focus": [
      "หลักวินัยการเงินการคลังของรัฐ",
      "3 ห่วง 2 เงื่อนไขของเศรษฐกิจพอเพียง",
      "หลักการ 4 ข้อของ พ.ร.บ.จัดซื้อจัดจ้างฯ",
      "วิธีจัดซื้อ 3 วิธี: ประกาศทั่วไป / คัดเลือก / เฉพาะเจาะจง",
      "ตัวอย่างสถานการณ์ที่ผิดหลักการ"
    ],
    "groups": [
      {
        "title": "วินัยการเงินการคลังของรัฐ",
        "bullets": [
          "ใช้งบประมาณให้คุ้มค่า โปร่งใส มีประสิทธิภาพ และยั่งยืน",
          "ไม่สร้างหนี้เกินศักยภาพของท้องถิ่น มีการประเมินผลกระทบระยะยาว",
          "ผู้บริหารต้องรับผิดชอบต่อผลการใช้จ่ายงบประมาณ"
        ]
      },
      {
        "title": "ปรัชญาเศรษฐกิจพอเพียง",
        "bullets": [
          "3 ห่วง: พอประมาณ, มีเหตุผล, มีภูมิคุ้มกันในตัวที่ดี",
          "2 เงื่อนไข: ความรู้ (รอบรู้ รอบคอบ ระมัดระวัง) และคุณธรรม (ซื่อสัตย์ ขยัน อดทน)",
          "ใช้คิดโครงการ อบจ. ไม่ลงทุนใหญ่เกินรายได้ และต้องมีแผนสำรอง"
        ]
      },
      {
        "title": "พ.ร.บ.จัดซื้อจัดจ้างฯ 2560",
        "bullets": [
          "หลักการ 4 ข้อ: ความคุ้มค่า, โปร่งใส, มีประสิทธิภาพและประสิทธิผล, ตรวจสอบได้",
          "วิธีประกาศเชิญชวนทั่วไป — e-bidding/e-market เป็นวิธีหลัก โปร่งใสที่สุด",
          "วิธีคัดเลือก — ใช้เมื่องานซับซ้อน หรือเคยประกาศแล้วไม่มีผู้สนใจ หรือจำกัดผู้มีคุณสมบัติพิเศษ",
          "วิธีเฉพาะเจาะจง — ใช้เมื่องานวงเงินเล็กน้อย มีผู้ค้ารายเดียว หรือกรณีเร่งด่วนบางประเภท"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GA4",
    "quiz": [
      "ยกตัวอย่างโครงการของ อบจ. ที่เสี่ยงผิดวินัยการคลัง และลองปรับให้สอดคล้องเศรษฐกิจพอเพียง",
      "สถานการณ์ต่อไปนี้ ข้อใดผิด พ.ร.บ.จัดซื้อจัดจ้างฯ ชัดเจน: (ก) ต่อสัญญารายเดิมทุกปีโดยไม่เปิดโอกาสรายใหม่ (ข) เปิด e-bidding ให้ผู้สนใจทั่วไป"
    ],
    "quizHint": "จำหลักการ 4 ข้อ + 3 วิธีจัดซื้อให้แม่น แล้วลองมองโจทย์ว่าเคสไหนโปร่งใส/ตรวจสอบได้จริง"
  },
  {
    "id": "gb-national-health-act",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — กฎหมายสุขภาพ",
    "code": "GB1",
    "title": "พ.ร.บ.สุขภาพแห่งชาติ 2550 และสิทธิด้านสุขภาพ",
    "badge": "มาตรา 7 & 12",
    "summary": "จำให้ได้ว่า ‘สุขภาพ’ ตาม พ.ร.บ. นี้มองแบบองค์รวม (กาย จิต ปัญญา สังคม) และจำมาตรา 7 เรื่องความลับข้อมูลสุขภาพ กับมาตรา 12 เรื่อง Living Will",
    "focus": [
      "นิยามสุขภาพ 4 มิติ",
      "สิทธิได้รับบริการสาธารณสุขและข้อมูลสุขภาพของตน",
      "มาตรา 7: ข้อมูลสุขภาพเป็นความลับ",
      "มาตรา 12: Living Will (พินัยกรรมชีวิต)",
      "กลไกคณะกรรมการสุขภาพแห่งชาติและสมัชชาสุขภาพ"
    ],
    "groups": [
      {
        "title": "นิยามสุขภาพแบบองค์รวม",
        "bullets": [
          "สุขภาพ = ภาวะสมบูรณ์สมดุลทั้งกาย จิต ปัญญา และสังคม",
          "ไม่ใช่แค่ไม่มีโรค แต่รวมถึงคุณภาพชีวิตและสิ่งแวดล้อม",
          "มองคนทั้งคน รวมครอบครัว ชุมชน และบริบททางสังคม"
        ]
      },
      {
        "title": "สิทธิด้านสุขภาพ",
        "bullets": [
          "สิทธิได้รับบริการสาธารณสุขที่มีมาตรฐานอย่างทั่วถึง",
          "สิทธิได้รับข้อมูลข่าวสารด้านสุขภาพของตนเอง",
          "สิทธิร้องเรียนเมื่อได้รับบริการไม่เป็นธรรมหรือถูกละเมิดสิทธิ"
        ]
      },
      {
        "title": "มาตราสำคัญที่ออกสอบบ่อย",
        "bullets": [
          "มาตรา 7: ข้อมูลสุขภาพส่วนบุคคลเป็นความลับ ห้ามเปิดเผยโดยไม่ได้รับความยินยอม เว้นแต่มีเหตุผลด้านกฎหมาย/สาธารณะ",
          "มาตรา 12: บุคคลมีสิทธิทำหนังสือแสดงเจตนาไม่ประสงค์รับบริการที่เป็นเพียงการยื้อชีวิตในวาระสุดท้าย (Living Will)",
          "ผู้ประกอบวิชาชีพต้องเคารพเจตนา ไม่ถือเป็นการกระทำผิด"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB1",
    "quiz": [
      "อธิบายความหมายของคำว่า ‘สุขภาพ’ ตาม พ.ร.บ.สุขภาพแห่งชาติใน 2–3 บรรทัด",
      "ยกตัวอย่างสถานการณ์ที่ต้องอ้างอิงมาตรา 7 เรื่องความลับข้อมูลสุขภาพ",
      "ยกตัวอย่างสถานการณ์ที่ผู้ป่วยอาจใช้สิทธิตามมาตรา 12 (Living Will)"
    ],
    "quizHint": "เชื่อมมาตรา 7 กับหลักจริยธรรมเรื่อง Confidentiality และเชื่อมมาตรา 12 กับ Autonomy"
  },
  {
    "id": "gb-nursing-act",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — กฎหมายวิชาชีพ",
    "code": "GB2",
    "title": "พ.ร.บ.วิชาชีพการพยาบาลและการผดุงครรภ์ และบทบาทสภาการพยาบาล",
    "badge": "ใบอนุญาต 5 ปี",
    "summary": "รู้ขอบเขตวิชาชีพพยาบาล ใบอนุญาตต้องต่ออายุทุก 5 ปี และรู้บทบาทของสภาการพยาบาลในด้านมาตรฐานและวินัยวิชาชีพ",
    "focus": [
      "ความหมายของการพยาบาลตามกฎหมาย",
      "ขอบเขตการประกอบวิชาชีพพยาบาล",
      "การขึ้นทะเบียนและต่ออายุใบอนุญาต 5 ปี",
      "บทบาทสภาการพยาบาล",
      "ผลกระทบถ้าประกอบวิชาชีพโดยไม่มีใบอนุญาต"
    ],
    "groups": [
      {
        "title": "ความหมายและขอบเขตวิชาชีพพยาบาล",
        "bullets": [
          "การดูแลช่วยเหลือผู้ป่วย การป้องกันโรค การส่งเสริมสุขภาพ และการฟื้นฟูสภาพ",
          "ประเมิน วินิจฉัย วางแผน ปฏิบัติ และประเมินผลการพยาบาล",
          "ให้สุขศึกษาแก่บุคคล ครอบครัว และชุมชน"
        ]
      },
      {
        "title": "ใบอนุญาตและการขึ้นทะเบียน",
        "bullets": [
          "ผู้ประกอบวิชาชีพต้องจบตามเกณฑ์และผ่านการสอบ",
          "ต้องขึ้นทะเบียนและรับใบอนุญาตจากสภาการพยาบาล",
          "ใบอนุญาตต้องต่ออายุทุก 5 ปี พร้อมหลักฐานการพัฒนาวิชาชีพต่อเนื่อง"
        ]
      },
      {
        "title": "บทบาทของสภาการพยาบาล",
        "bullets": [
          "ออก ต่ออายุ พักใช้ และเพิกถอนใบอนุญาต",
          "กำหนดมาตรฐานวิชาชีพและจรรยาบรรณ",
          "พิจารณาเรื่องร้องเรียนทางวินัย และผดุงเกียรติวิชาชีพพยาบาล"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB2",
    "quiz": [
      "ใบอนุญาตประกอบวิชาชีพต้องต่ออายุทุกกี่ปี และต้องใช้หลักฐานอะไรบ้าง?",
      "ยกตัวอย่างหัตถการที่อยู่ในขอบเขตพยาบาล 2 อย่าง และยกอย่างหนึ่งที่น่าจะอยู่นอกขอบเขต",
      "เมื่อเกิดกรณีร้องเรียนเรื่องความผิดพลาดในการดูแลผู้ป่วย สภาการพยาบาลมีบทบาทอย่างไร?"
    ],
    "quizHint": "จำคำว่า ‘5 ปี’ ให้ขึ้นใจ และเชื่อมบทบาทสภาการพยาบาลกับเรื่องวินัยและมาตรฐานวิชาชีพ"
  },
  {
    "id": "gb-ems-act",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — การแพทย์ฉุกเฉิน",
    "code": "GB3",
    "title": "พ.ร.บ.การแพทย์ฉุกเฉิน 2551 ระบบ EMS และ UCEP",
    "badge": "1669 / 72 ชม.",
    "summary": "จำเลข 1669 หลัก ‘ช่วยก่อนถามสิทธิทีหลัง’ และช่วงเวลา 72 ชั่วโมงแรกของ UCEP ในผู้ป่วยฉุกเฉินวิกฤต",
    "focus": [
      "ความหมายผู้ป่วยฉุกเฉิน",
      "สิทธิผู้ป่วยฉุกเฉินตามกฎหมาย",
      "หลักช่วยก่อนถามสิทธิทีหลัง",
      "UCEP และ 72 ชั่วโมงแรก",
      "บทบาทท้องถิ่นและ EMS"
    ],
    "groups": [
      {
        "title": "ผู้ป่วยฉุกเฉินและสิทธิ",
        "bullets": [
          "ผู้ป่วยที่มีภยันตรายต่อชีวิตหรืออวัยวะจำเป็น ต้องช่วยเหลือทันที",
          "มีสิทธิได้รับบริการการแพทย์ฉุกเฉินโดยไม่ถูกปฏิเสธ",
          "หลักสำคัญ: ช่วยก่อนถามสิทธิทีหลัง ไม่ต้องวางเงินล่วงหน้าในระยะวิกฤต"
        ]
      },
      {
        "title": "ระบบ UCEP (เจ็บป่วยฉุกเฉินวิกฤต)",
        "bullets": [
          "ผู้ป่วยฉุกเฉินวิกฤตมีสิทธิรับการรักษาที่โรงพยาบาลใดก็ได้ที่ใกล้ที่สุด",
          "ไม่ต้องสำรองจ่ายในช่วงเวลาประมาณ 72 ชั่วโมงแรก",
          "เมื่อพ้นภาวะฉุกเฉิน สามารถส่งต่อไปโรงพยาบาลตามสิทธิหลักประกันสุขภาพของตน"
        ]
      },
      {
        "title": "ระบบ EMS และบทบาทท้องถิ่น",
        "bullets": [
          "สายด่วน 1669 เป็นศูนย์รับแจ้งเหตุฉุกเฉิน",
          "หน่วยปฏิบัติการฉุกเฉินมีหลายระดับ (พื้นฐาน ทั่วไป เฉพาะทาง)",
          "องค์กรปกครองส่วนท้องถิ่น เช่น เทศบาล/อบต./อบจ. สามารถจัดตั้งหน่วยกู้ชีพเข้าร่วมระบบ EMS ได้"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB3",
    "quiz": [
      "UCEP คืออะไร และช่วงเวลา 72 ชั่วโมงแรกสำคัญอย่างไร?",
      "อธิบาย flow การดูแลผู้ป่วยตั้งแต่โทร 1669 จนถึงการส่งต่อผู้ป่วยหลังพ้นภาวะฉุกเฉิน"
    ],
    "quizHint": "จำคำว่า ‘ช่วยก่อนถามสิทธิทีหลัง’ และ 72 ชั่วโมงแรกให้ขึ้นใจ เพราะมักออกทั้งข้อสอบปรนัยและอัตนัย"
  },
  {
    "id": "gb-nursing-process-ethics",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — กระบวนการพยาบาล",
    "code": "GB4",
    "title": "กระบวนการพยาบาล จริยธรรมพื้นฐาน และการบันทึก",
    "badge": "5 ขั้นตอน / Ethics",
    "summary": "จำ 5 ขั้นตอนกระบวนการพยาบาล และจับคู่กับหลักจริยธรรม (Beneficence, Autonomy, Confidentiality ฯลฯ) รวมทั้งเน้นการบันทึกที่ถูกต้อง ครบถ้วน ทันเวลา",
    "focus": [
      "5 ขั้นตอนกระบวนการพยาบาล",
      "หลักจริยธรรมสำคัญ: Beneficence, Non-maleficence, Autonomy, Justice, Confidentiality",
      "การบันทึกทางการพยาบาลที่ดี",
      "ความเสี่ยงทางกฎหมายจากการบันทึกไม่ครบหรือย้อนหลัง"
    ],
    "groups": [
      {
        "title": "5 ขั้นตอนกระบวนการพยาบาล",
        "bullets": [
          "Assessment — เก็บข้อมูลอัตนัย/ปรนัย",
          "Nursing Diagnosis — ระบุปัญหา/ภาวะเสี่ยง",
          "Planning — ตั้งเป้าหมายและวางแผนการดูแล",
          "Implementation — ปฏิบัติการพยาบาลตามแผน",
          "Evaluation — ประเมินผลว่าบรรลุเป้าหมายหรือไม่"
        ]
      },
      {
        "title": "หลักจริยธรรมพื้นฐาน",
        "bullets": [
          "Beneficence — ทำเพื่อประโยชน์สูงสุดของผู้ป่วย",
          "Non-maleficence — ไม่ทำอันตราย/ไม่ทำให้แย่ลง",
          "Autonomy — เคารพการตัดสินใจของผู้ป่วย",
          "Justice — ให้การดูแลอย่างเป็นธรรม ไม่เลือกปฏิบัติ",
          "Confidentiality — รักษาความลับข้อมูลผู้ป่วย"
        ]
      },
      {
        "title": "การบันทึกทางการพยาบาล",
        "bullets": [
          "ต้องถูกต้อง ครบถ้วน ทันเวลา สะท้อนข้อเท็จจริง",
          "การบันทึกย้อนหลังทีเดียวหลายวันเสี่ยงถูกตั้งข้อสงสัยว่าแต่งข้อมูล",
          "เวชระเบียนเป็นหลักฐานสำคัญทั้งด้านการรักษาและด้านกฎหมาย"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB4",
    "quiz": [
      "เรียงลำดับ 5 ขั้นตอนกระบวนการพยาบาล พร้อมยกตัวอย่างกิจกรรมแต่ละขั้นตอน",
      "ยกตัวอย่างเคสที่ต้องใช้หลัก Autonomy และ Confidentiality พร้อมกัน",
      "ทำไมการบันทึกไม่ทันเวลาจึงเสี่ยงต่อการถูกมองว่า ‘ผิด’ ในมุมกฎหมาย?"
    ],
    "quizHint": "พยายามคิดเคสจริงจากประสบการณ์ เช่น คนไข้ปฏิเสธการรักษา หรือญาติขอดูข้อมูลผู้ป่วย"
  },
  {
    "id": "gb-community-role",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — พยาบาลชุมชน/ท้องถิ่น",
    "code": "GB5",
    "title": "บทบาทพยาบาลในท้องถิ่น/อบจ. และระบบบริการสุขภาพ",
    "badge": "ภาพใหญ่ชุมชน",
    "summary": "มองระบบสุขภาพทั้ง 4 ด้าน (ส่งเสริม ป้องกัน รักษา ฟื้นฟู) และระดับบริการ (ปฐมภูมิ ทุติยภูมิ ตติยภูมิ) แล้วเชื่อมบทบาทพยาบาลชุมชนในสังกัด อบจ.",
    "focus": [
      "บริการสุขภาพ 4 ด้าน",
      "ระดับบริการสุขภาพ 3 ระดับ",
      "บทบาทพยาบาลชุมชน/ท้องถิ่น",
      "การใช้ข้อมูลสุขภาพพื้นที่วางแผนโครงการ"
    ],
    "groups": [
      {
        "title": "บริการสุขภาพ 4 ด้าน",
        "bullets": [
          "ส่งเสริมสุขภาพ — โครงการออกกำลังกาย อาหารปลอดภัย คลินิกเลิกบุหรี่ ฯลฯ",
          "ป้องกันโรค — วัคซีน การคัดกรอง NCDs การคัดกรองมะเร็ง",
          "รักษาพยาบาล — ดูแลผู้ป่วยเฉียบพลัน/เรื้อรัง ให้ยา ทำหัตถการ",
          "ฟื้นฟูสมรรถภาพ — กายภาพบำบัด การฟื้นฟูหลังโรคหลอดเลือดสมอง ฯลฯ"
        ]
      },
      {
        "title": "ระดับบริการสุขภาพ",
        "bullets": [
          "ปฐมภูมิ — รพ.สต., คลินิกชุมชนอบอุ่น",
          "ทุติยภูมิ — รพ.ชุมชน/ทั่วไป",
          "ตติยภูมิ — รพ.ศูนย์/เฉพาะทาง"
        ]
      },
      {
        "title": "บทบาทพยาบาลในท้องถิ่น/อบจ.",
        "bullets": [
          "รวบรวม/วิเคราะห์ข้อมูลสุขภาพในพื้นที่ เช่น NCDs ผู้สูงอายุ อุบัติเหตุ ฯลฯ",
          "ร่วมออกแบบโครงการสุขภาพกับ อบจ./เทศบาล/ชุมชน ให้ตรงกับปัญหาจริง",
          "ติดตามและประเมินผลโครงการ เพื่อปรับปรุงรอบต่อไป"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB5",
    "quiz": [
      "ออกแบบโครงการ ‘ลดการสูบบุหรี่ในชุมชน’ โดยระบุขั้นตอนตั้งแต่เก็บข้อมูล → วางแผน → ทำกิจกรรม → ประเมินผล",
      "อบจ. สามารถสนับสนุนระบบสุขภาพปฐมภูมิในพื้นที่ได้อย่างน้อย 2 ด้านอะไรบ้าง?"
    ],
    "quizHint": "ลองคิดโครงการจากปัญหาจริงในพื้นที่ เช่น เบาหวาน ความดัน อุบัติเหตุทางถนน ฯลฯ"
  },
  {
    "id": "gb-triage-vitals",
    "section": "ภาค ข",
    "sectionLabel": "ภาค ข — ฉุกเฉินพื้นฐาน",
    "code": "GB6",
    "title": "Triage การคัดกรองผู้ป่วย และสัญญาณชีพ (Vital Signs)",
    "badge": "จำสี + ตัวเลข",
    "summary": "จำระดับสีของ triage (Red / Yellow / Green / White / Black) และค่าปกติของ T P R BP ในผู้ใหญ่ ให้สามารถอ่านสถานการณ์ได้เร็ว",
    "focus": [
      "สีของ triage และตัวอย่างอาการแต่ละสี",
      "ค่า T/P/R/BP ปกติของผู้ใหญ่",
      "ตัวอย่างค่าที่อันตรายต้องรีบรายงานแพทย์",
      "การใช้ vital sign + อาการประกอบการตัดสินใจ triage"
    ],
    "groups": [
      {
        "title": "ระบบคัดกรองผู้ป่วย (Triage)",
        "bullets": [
          "Red — วิกฤต: หยุดหายใจ ช็อก ไม่รู้สึกตัว ต้องช่วยทันที",
          "Yellow — เร่งด่วน: หายใจลำบาก เจ็บหน้าอก กระดูกหักเปิด รอได้ไม่นาน",
          "Green — ไม่เร่งด่วน: แผลถลอก ไข้ต่ำ เจ็บป่วยทั่วไป",
          "White — ทั่วไป: มารับยา ตรวจตามนัด",
          "Black — เสียชีวิต: ไม่มีสัญญาณชีพหรือเสียชีวิตก่อนถึงโรงพยาบาล"
        ]
      },
      {
        "title": "สัญญาณชีพพื้นฐาน (ผู้ใหญ่)",
        "bullets": [
          "Temperature: ประมาณ 36.5–37.5 °C",
          "Pulse: ประมาณ 60–100 ครั้ง/นาที",
          "Respiration: ประมาณ 12–20 ครั้ง/นาที",
          "Blood Pressure: ประมาณไม่เกิน 120/80 mmHg (ขึ้นกับบริบท)"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GB6",
    "quiz": [
      "ผู้ป่วยหายใจเร็วมากริมฝีปากเขียว ซึมลง ควรอยู่สีใดของ triage และควรจัดการเบื้องต้นอย่างไร?",
      "ยกตัวอย่างค่าความดันโลหิต / ชีพจร / อัตราการหายใจ ที่ควรรีบรายงานแพทย์ทันที"
    ],
    "quizHint": "ฝึกอ่านชุดตัวเลข vital พร้อมอาการ เช่น BP ต่ำ + P เร็ว + ซึม = นึกถึง shock/Red"
  },
  {
    "id": "gc-overview",
    "section": "ภาค ค",
    "sectionLabel": "ภาค ค — ภาพรวม",
    "code": "GC1",
    "title": "เขาดูอะไรในภาค ค และควรเตรียมตัวอย่างไร",
    "badge": "Mindset คนของชุมชน",
    "summary": "ภาค ค เน้นทัศนคติ บุคลิกภาพ การทำงานเป็นทีม และความเข้าใจบทบาทพยาบาลในท้องถิ่น มากกว่าทดสอบวิชาการลึก ๆ",
    "focus": [
      "ทัศนคติต่อวิชาชีพพยาบาล",
      "ความเป็นคนท้องถิ่นและเข้าใจระบบสุขภาพในพื้นที่",
      "การทำงานเป็นทีมและการสื่อสาร",
      "การเล่าเรื่องแบบ STAR (Situation / Task / Action / Result)"
    ],
    "groups": [
      {
        "title": "สิ่งที่กรรมการมองหา",
        "bullets": [
          "มองงานพยาบาลเป็นการรับใช้ประชาชน ไม่ใช่แค่เงินเดือน",
          "เข้าใจบทบาทของท้องถิ่นและระบบสุขภาพระดับพื้นที่",
          "ทำงานกับทีมสุขภาพ ทีม อปท. และชุมชนได้",
          "ซื่อสัตย์ โปร่งใส รับผิดชอบ และสื่อสารได้ดี"
        ]
      },
      {
        "title": "ประเภทคำถามที่เจอบ่อย",
        "bullets": [
          "คำถามตัวตนและประวัติ: จุดแข็ง จุดที่อยากพัฒนา เหตุผลลาออกจากที่เก่า",
          "คำถามสถานการณ์: ญาติร้องเรียน เพื่อนร่วมงานไม่รับผิดชอบ ขัดแย้งในทีม ฯลฯ",
          "คำถามวิสัยทัศน์: ถ้าได้บรรจุอยากพัฒนาระบบสุขภาพในพื้นที่อย่างไร"
        ]
      },
      {
        "title": "เทคนิคเล่าเรื่องแบบ STAR",
        "bullets": [
          "S — Situation: เล่าฉากหลังสั้น ๆ",
          "T — Task: หน้าที่ของเราในเหตุการณ์นั้น",
          "A — Action: สิ่งที่เราตัดสินใจทำ",
          "R — Result: ผลลัพธ์ที่เกิดขึ้นและบทเรียนที่ได้"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GC1",
    "quiz": [
      "ลองเขียนคำตอบ 3–5 บรรทัดสำหรับคำถาม ‘ทำไมถึงอยากเป็นพยาบาลในสังกัด อบจ.?’",
      "เลือกเหตุการณ์จริงที่เคยทำงานหนักหรือเจอปัญหาใหญ่ แล้วเล่าแบบ STAR"
    ],
    "quizHint": "เชื่อมคำตอบกับคำว่า ‘ชุมชน’, ‘ระบบสุขภาพพื้นที่’, ‘ทำงานระยะยาวเพื่อคนในพื้นที่’"
  },
  {
    "id": "gc-checklist",
    "section": "ภาค ค",
    "sectionLabel": "ภาค ค — Checklist",
    "code": "GC2",
    "title": "Checklist เตรียมตัวสัมภาษณ์ให้พร้อม",
    "badge": "เช็คให้ครบก่อนวันจริง",
    "summary": "ใช้หัวข้อนี้เป็น checklist เช็กว่าพร้อมทั้งเนื้อหา ตัวอย่างเหตุการณ์ บุคลิกภาพ และคำถามที่อยากถามกรรมการแล้วหรือยัง",
    "focus": [
      "ทบทวนเนื้อหาวิชาการให้เล่าเป็นภาษาของตัวเองได้",
      "เตรียมตัวอย่างเหตุการณ์จริง 3–5 เคส",
      "เตรียมเรื่องบุคลิกภาพและการแต่งกาย",
      "เตรียมคำถามที่อยากถามกรรมการ"
    ],
    "groups": [
      {
        "title": "เนื้อหาวิชาการ",
        "bullets": [
          "ทบทวนภาค ก/ข ให้สามารถอธิบายเป็นภาษาของตัวเองได้",
          "เลือกหัวข้อที่กรรมการอาจถามต่อ เช่น กฎหมายสุขภาพ/บทบาทพยาบาลในชุมชน"
        ]
      },
      {
        "title": "ตัวอย่างเหตุการณ์จริง",
        "bullets": [
          "เหตุการณ์ที่ต้องแก้ปัญหายาก ๆ หรือเร่งด่วน",
          "เหตุการณ์เกี่ยวกับการทำงานเป็นทีมและการสื่อสาร",
          "เหตุการณ์ที่เคยทำผิดพลาด แต่เรียนรู้และพัฒนาตัวเองได้"
        ]
      },
      {
        "title": "บุคลิกภาพและการแต่งกาย",
        "bullets": [
          "ชุดเรียบร้อยสีสุภาพ รองเท้าแบบหุ้มส้น",
          "ฝึกการไหว้ การสบตา และภาษากายให้นอบน้อมแต่มั่นใจ",
          "ควบคุมอารมณ์และน้ำเสียงในคำถามกดดัน"
        ]
      },
      {
        "title": "คำถามที่อยากถามกรรมการ",
        "bullets": [
          "โครงสร้างทีมพยาบาลใน อบจ.",
          "โครงการสุขภาพที่ อบจ. ให้ความสำคัญในช่วงนี้",
          "โอกาสเติบโตในสายงานในอนาคต"
        ]
      }
    ],
    "quizTitle": "Mini-quiz GC2",
    "quiz": [
      "ลองเขียน checklist ส่วนตัวจากหัวข้อนี้ แล้วติ๊กว่าอะไร ‘พร้อมแล้ว’ กับอะไร ‘ยังไม่พร้อม’",
      "ซ้อมตอบหน้ากระจกหรืออัดวิดีโอสั้น ๆ แล้วสังเกตภาษากายของตัวเอง"
    ],
    "quizHint": "โฟกัสทั้ง ‘เนื้อหา’ และ ‘ภาพรวมบุคลิก’ ไม่ใช่แค่จำคำตอบ"
  }
]
